///////////////////////////////////////////////////////////////////////

function getData(){
    var sb = document.querySelector('#data');  
        sb.options[0].value="महाराष्ट्र में जनवरी के तीसरे हफ्ते तक कोरोना संक्रमितों का आंकड़ा 2 लाख तक पहुंच सकता है महाराष्ट्र के एडिशनल चीफ सेक्रेटरी हेल्थ डॉ. प्रदीप व्यास ने इस बारे में जानकारी दी डॉ व्यास के मुताबिक वर्तमान हालात के मद्देनजर जनवरी के तीसरे हफ्ते तक में राज्य में कोरोना के 2 लाख एक्टिव केस हो जाएंगे अगर इनमें से कुछ लोगों को हॉस्पिटल में एडमिट करना पड़ता है तो अधिकारियों को हालात संभालने के लिए तैयार रहने के निर्देश दिए गए हैं जल्द से जल्द वैक्सीन लगवाएं डॉ. व्यास ने कहा- आम लोगों को ओमिक्रॉन की वजह से आने वाली तीसरी लहर से घबराने की जरूरत नहीं है ओमिक्रॉन दूसरे वैरिएंट के मुकाबले कम घातक है हालांकि इससे उन लोगों को ज्यादा खतरा है जिन्होंने अभी तक कोरोना वैक्सीन नहीं ली है इसलिए जल्द से जल्द वैक्सीन लगवाएं महाराष्ट्र सरकार ने कोरोना की बढ़ती रफ्तार को देखते हुए गुरुवार को पब्लिक गैदरिंग के लिए नई गाइडलाइन जारी की है अब शादी और सार्वजनिक कार्यक्रमों में सिर्फ लोग ही शामिल हो पाएंगे इसके अलावा अंतिम संस्कार में लोगों को ही शामिल होने की परमिशन होगी तीसरी लहर भारत में तबाही लाएगी भारत में ओमिक्रॉन वैरिएंट की वजह से हर दिन 60 हजार लोगों को हॉस्पिटल में एडमिट करना पड़ सकता है यह जानकारी एनडीटीवी की एक रिपोर्ट में दी गई है रिपोर्ट के मुताबिक सरकार की तरफ से जारी किए गए आंकड़ों में ओमिक्रॉन संक्रमितों की संख्या से कुछ ज्यादा बताई गई है जबकि हकीकत में संख्या इससे गुना ज्यादा यानी के आस पास हो सकती है भारत ओमिक्रॉन संक्रमितों के मामले में उन देशों के नक्शे कदम पर है जहां कोरोना के कुल मामलों में से इसी वैरिएंट की वजह हैं ओमिक्रॉन से ही खत्म होगा कोरोना ब्रिटिश मेडिकल काउंसिल के पूर्व वैज्ञानिक ने ओमिक्रॉन के खतरे के बीच राहत"; 
		sb.options[1].value="लिया जाना चाहिए। याचिका में दलील दी गई कि सार्वजनिक स्थानों पर महिलाओं की गरिमा की रक्षा के लिए स्तनपान और चाइल्ड केयर रूम मुहैया कराना जरूरी है, क्योंकि बड़ी संख्या में महिलाएं रोजगार के लिए घरों से निकलती हैं। याचिका में कहा गया है कि भारतीय संविधान के अनुच्छेद 42 और 47 के तहत राज्य नीति निदेशक सिद्धांतों में लोगों का जीवन और महिलाओं और बच्चों के सार्वजनिक स्वास्थ्य में सुधार, महिलाओं और बच्चों की स्वास्थ्य देखभाल को राज्य के कर्तव्य बताया गया है। फीडिंग व चाइल्ड केयर रूम बुनियादी सुविधाओं के तहत मुहैया कराना जरूरी है, लेकिन इस संबंध में कोई ठोस कदम नहीं उठाया गया है। लिहाजा सार्वजनिक स्थानों पर इन सुविधाओं की स्थापना के लिए व्यापक दिशा निर्देशों की जरूरत है। याचिकाकर्ता मातृ स्पर्श, अव्यान फाउंडेशन सार्वजनिक स्थानों पर अपने स्तर पर ब्रेस्टफीडिंग रूम, चाइल्ड केयर रूम और क्रेच स्थापित कर रहा है, लेकिन इस कार्य में सरकार की व्यापक मदद और स्पष्ट दिशा-निर्देश की दरकार है। शीर्ष अदालत की मप्र हाईकोर्ट के आदेश पर रोक, नहीं होगी सीबीआई जांच सुप्रीम कोर्ट ने मध्य प्रदेश हाईकोर्ट के उस फैसले पर रोक लगा दी है, जिसके तहत राज्य में 2017 के बाद से शुरू हुए सभी नर्सिंग कॉलेजों की सीबीआई जांच के आदेश दिए थे। चीफ जस्टिस यूयू ललित और जस्टिस बेला एम त्रिवेदी की पीठ ने मप्र हाईकोर्ट की ग्वालियर बेंच के आदेश को चुनौती देने वाली ग्वालियर के प्रिस्टन कॉलेज की याचिका पर सुनवाई ने यह रोक लगाई। कॉलेज की तरफ से पेश वकील ने कहा कि 2017 और उसके बाद से अस्तित्व में आए सभी नर्सिंग कॉलेजों की संबद्धता की जांच कराने का हाईकोर्ट का आदेश उचित नहीं है। इसके बाद शीर्ष अदालत ने हाईकोर्ट के आदेश पर रोक लगा दी है। ईडी निदेशक का कार्यकाल बढ़ाने को लेकर केंद्र की याचिका पर नोटिस सुप्रीम कोर्ट ने प्रवर्तन निदेशालय के निदेशक संजय कुमार मिश्रा का कार्यकाल बढ़ाने के लिए उसके आदेश में संशोधन की मांग वाली केंद्र की याचिका पर ‘कॉमन कॉज’ संस्था को नोटिस जारी किया है। जस्टिस बीआर गवई और जस्टिस बीवी नागरत्ना की पीठ ने कॉमन कॉज के वकील प्रशांत भूषण।"; 
		sb.options[2].value="कनाडा में कोरोना वैक्सीनेशन पर शुरू हुआ विरोध जस्टिन के घर तक पहुंच गया है राजधानी ओटावा में प्रदर्शनकारी ट्रक ड्राइवर्स ने के घर को घेर लिया है हालांकि इसके पहले ही परिवार सहित घर छोड़कर सीक्रेट लोकेशन पर चले गए हैं फ्रीडम कान्वॉइ नाम से चल रहा यह प्रदर्शन देश में कोरोना वैक्‍सीन को अनिवार्य किए जाने और लॉकडॉउन लगाने के खिलाफ है कनाडाई ब्रॉडकास्टिंग कॉर्पोरेशन के मुताबिक हजारों ट्रक ड्राइवर्स और प्रदर्शनकारी शनिवार को राजधानी ओटावा में इकट्‌ठे हो गए ओटावा में प्रधानमंत्री आवास को 50 हजार ट्रक ड्राइवर्स ने 20 हजार ट्रकों के साथ चारों तरफ से घेर लिया है उनकी मांग है कि वैक्सीन जनादेश और अन्य हेल्थ प्रतिबंधों को खत्म किया जाए प्रदर्शनकारी अपने साथ बच्चे बुजुर्ग और विकलांग लोगों को साथ लेकर पहुंचे इन लोगों ने प्रधानमंत्री को लेकर अश्लीलता से भरी नारेबाजी भी की कुछ प्रदर्शनकारियों को नेशनल वॉर मेमोरियल पर नाचते देखा गया जिसकी कनाडा के टॉप सोल्जर जनरल वेन आइरे और कनाडा की रक्षा मंत्री अनीता आनंद ने निंदा की कड़ाके की ठंड की चेतावनी के बावजूद सैकड़ों प्रदर्शनकारियों के पार्लियामेंट एरिया में घुस जाने के बाद संभावित हिंसा को लेकर पुलिस हाई अलर्ट पर है वैक्सीनेशन को अनिवार्य करने के पहले ने कहा था कि ट्रक वाले न केवल अपने लिए बल्कि देश के बाकी लोगों के लिए खतरा बन गए हैं अमेरिका के ईस्ट कोस्ट में बर्फीला तूफान केनान भयानक तबाही मचा रहा है तूफान की वजह से लगभग 7 करोड़ लोग आफत में पड़ गए हैं न्यूयॉर्क और बोस्टन की बिजली गुल हो गई है जिस वजह से शहर की रफ्तार पूरी तरह से थम गई न्यूयॉर्क न्यू जर्सी मैरीलैंड रोड आइलैंड और वर्जीनिया राज्य में इमरजेंसी लगा दी गई है इस इलाके में चार साल बाद इतना बढ़ा तूफान आया है शनिवार को नेशनल वेदर सर्विस ने"; 
		sb.options[3].value="स्पूतनिक की रिपोर्ट के मुताबिक कोरोना का ये नया वैरिएंट साउथ अफ्रीका के चमगादड़ों में पाया गया है नियोकोव चमगादड़ों में बहुत तेजी से फैला है इसी वजह से इस वायरस से इंसानों को भी खतरा माना जा रहा है इससे पहले भी 2019 में जब चीन में दुनिया का पहला कोरोना केस सामने आया था तब भी कई रिपोर्ट्स में इसके चमगादड़ के जरिए ही इंसानों में फैलने की बात कही गई थी लैब लीक थ्योरी के मुताबिक चीन के वुहान के लैब में चमगादड़ों पर किए जा रहे प्रयोग के दौरान ही कोरोना वायरस लीक होकर इंसानों में फैला इस थ्योरी के मुताबिक ये भी संभव है कि चीन ने जानबूझकर कोरोना वायरस में जेनेटिक बदलाव करते हुए इसे इंसानों में फैलाया हालांकि चीन इस थ्योरी को नकारता रहा है उसका कहना है कि कोरोना वुहान में जानवरों के एक मार्केट से इंसानों में फैला था वुहान यूनिवर्सिटी एंड द चाइनीज एकेडमी ऑफ साइंसेज इंस्टीट्यूट ऑफ बायोफिजिक्स के रिसर्चर्स का दावा है कि इस नए कोरोना वायरस के इंसान तक पहुंचने के लिए इसमें बस एक म्यूटेशन की जरूरत है वेबसाइट पर पब्लिश स्टडी के मुताबिक नया वायरस नियोकोव और इसका करीबी वायरस इंसानों को भी संक्रमित कर सकता है रिसर्चर्स का दावा है कि नया कोरोना वैरिएंट नियोकोव किसी भी तरह की इम्यूनिटी को चकमा देने में सक्षम है इससे मौजूदा सभी कोरोना वैक्सीन इस पर बेअसर हो सकती हैं रिसर्चर्स ने कहा है कि नए वैरिएंट से इंसानों को ज्यादा खतरा इसलिए है क्योंकि यह होस्ट सेल इंसान के रिसेप्टर्स पर पहले के कोरोना वैरिएंट की तुलना में अलग तरीके से जुड़ता है दरअसल वायरस अपनी स्पाइक प्रोटीन पर पाए जाने वाले रिसेप्टर बाइंडिंग डोमेन के जरिए ही इंसान के दिल और फेफड़ों के सेल पर पाए जाने वाले प्रोटीन एंजियोटेंसिन कनवर्टिंग एंजाइम से चिपककर इंसान"; 
		sb.options[4].value="बदलाव का काम किया जाएगा इसी के साथ टाटा ग्रुप इसे पूरी तरह से बदलाव का काम करेगा उदाहरण के तौर पर केबिन को अपग्रेड किया जाएगा टाटा ग्रुप ने कहा है कि शुरू में वह 5 फ्लाइट्स में फ्री में खाना उपलब्ध कराएगी हालांकि अभी एअर इंडिया टाटा ग्रुप के बैनर तले नहीं उड़ेगी जिन फ्लाइट्स में फ्री खाना मिलेगा उसमें मुंबई दिल्ली की दो फ्लाइट्स मुंबई से बेंगलुरु शामिल हैं इसके अलावा मुंबई न्यूयॉर्क रूट पर चलने वाली फ्लाइट में भी फ्री खाना मिलेगा टाटा ग्रुप ने कहा कि बाद में फ्री खाने को चरणबद्ध तरीके से बढ़ाया जाएगा आइए जानते हैं कि एअर इंडिया की शुरुआत कैसे हुई कैसे वो टाटा से सरकार के पास और सरकार से फिर टाटा के पास आई कैसे पूरी एविएशन इंडस्ट्री में बदलाव होने वाला है और इसका फायदा कैसे यात्रियों को होने वाला है ओमिक्रॉन का खतरा अभी टला भी नहीं था कि एक और नए घातक कोरोना वायरस वैरिएंट की खोज ने पूरी दुनिया की मुश्किलें और बढ़ा दी हैं चीन के वुहान के रिसर्चर्स ने साउथ अफ्रीका में पाए गए एक नए तरह के कोरोना वायरस नियोकोव को लेकर चेतावनी जारी की है उनका दावा है कि इस नए कोरोना वायरस के फैलने की क्षमता और इससे मौत का खतरा दोनों ही बहुत ज्यादा है चीन के वुहान जहां 2019 में सबसे पहले कोरोना वायरस पाया गया था वहां के रिसर्चर्स ने एक नए तरह के कोरोना वायरस नियोकोव को लेकर चेतावनी जारी की है चीनी रिसर्चर्स का दावा है कि कोरोना वायरस के नए वैरिएंट नियोकोव के फैलने और मौत की दर दोनों बहुत ज्यादा हैं ये नई स्टडी वेबसाइट ने पब्लिश की है इस स्टडी के मुताबिक इस नए वायरस से हर तीन में से एक संक्रमित की मौत होने का खतरा है रूसी न्यूज एजेंसी"; 
		sb.options[5].value="स्टेट बैंक ने कहा कि वह एअर इंडिया को जितनी भी जरूरत होगी वर्किंग कैपिटल और अन्य के लिए लोन देगा एअर इंडिया के पास घरेलू और अंतरराष्ट्रीय रूट्स पर कई महत्वपूर्ण उड़ानें हैं ऐसे में कहा जा सकता है कि नए मैनेजमेंट के साथ डोमेस्टिक और इंटरनेशनल ट्रैवल करने वाले यात्रियों को बेहतर सुविधाएं मिल सकती हैं इसके तुरंत बाद एअर इंडिया ने अपने सोशल मीडिया हैंडल पर कहा कि दो आइकॉनिक नाम अब एक साथ आ गए हैं एअर इंडिया और टाटा ग्रुप एक नए चैप्टर की शुरुआत करेंगे हम अपनी समृद्ध विरासत और राष्ट्र की सेवा के लिए एक साझा मिशन द्वारा तेज गति से आगे बढ़ने के लिए तत्पर हैं वेलकम अ बोर्ड टाटा कंपनीज सिंधिया ने दी बधाई विमानन मंत्री ज्योतिरादित्य सिंधिया ने कहा कि नए मालिक को बधाई मुझे विश्वास है कि एयरलाइंस नए विंग के तहत चमकेगी टाटा ग्रुप महाराजा की खोई हुई चमक को प्राप्त करेगा शुरुआती फोकस में एअर इंडिया के समय पर प्रदर्शन को लेकर काम किया जाएगा इसकी लेटलतीफी बहुत ज्यादा इसके लिए दिक्कतें पैदा करती हैं केबिन क्रू को भेजा गया ईमेल टाटा ग्रुप ने केबिन क्रू को भेजे ईमेल में कहा कि हम आज रात से पब्लिक सेक्टर से प्राइवेट सेक्टर के तहत एअर इंडिया के लिेए काम करेंगे अगला सात दिन काफी महत्वपूर्ण है क्योंकि हम अपनी छवि और नजरिए को बदलेंगे इनफ्लाइट सेवाओं के लिए संदीप वर्मा और मेघा सिंघानिया का नाम तय किया गया है रतन टाटा की ओर से एक रिकार्डेड ऑडियो जारी किया गया है इसमें कहा गया है कि यात्रियों का एक मेहमान की तरह स्वागत किया जाएगा इनफ्लाइट के अनाउंस में बदलाव किया जाएगा केबिन क्रू अब स्मार्ट ड्रेस के रूप में नजर आएंगी नियमों का पालन करेंगी डिपॉर्चर के 10 मिनट पहले अब फ्लाइट का गेट बंद किया जाएगा"; 
		sb.options[6].value="देश की एविएशन इंडस्ट्री के लिए इस साल बड़ा बदलाव हुआ है सरकारी कंपनी एअर इंडिया जनवरी से प्राइवेट हो गई है टाटा संस ने आधिकारिक तौर पर एअर इंडिया को टेकओवर कर लिया है इसके बाद टाटा देश की दूसरी बड़ी एयरलाइन बन गई है एअर इंडिया के हैंडओवर से पहले टाटा संस के चेयरमैन नरेंद्र मोदी से मिले विनिवेश विभाग के सचिव ने सोशल मीडिया पर यह जानकारी दी इसमें उन्होंने कहा कि एअर इंडिया को टेकओवर करने की प्रक्रिया आज पूरी कर ली गई है और यह डील अब बंद हो चुकी है इसका पूरा शेयर टैलेस प्राइवेट लिमिटेड को ट्रांसफर किया जा चुका है इसके बाद चंद्रशेखरन ने कहा कि हम इस डील से काफी खुश हैं कि एअर इंडिया टाटा ग्रुप के पास आ गई है हम अब एक वर्ल्ड क्लास की एयरलाइंस बनाने के लिए काम करेंगे टाटा संस के चेयरमैन एन. चंद्रशेखरन ने एक चिट्‌ठी लिखी जिसमें कहा कि एअर इंडिया की जिस दिन से टाटा को दिए जाने की घोषणा हुई है घरवापसी यह शब्द सभी की जुबान पर था हम एअर इंडिया का टाटा परिवार में आने पर स्वागत करते हैं हमारी पहली फ्लाइट एअर इंडिया ही थी जिसमें मैंने दिसंबर 1986 में यात्रा की थी मैं उस दिन को कभी नहीं भूल सकता पर अब समय आगे देखने का आ गया है मैं अपने परिवार में आपका स्वागत करते हुए टाटा ग्रुप की तरफ से यह चिट्‌ठी लिख रहा हूं आज एक नए अध्याय की शुरुआत हुई है पूरा देश हमारी ओर देख रहा है इससे पहले प्रधानमंत्री से मुलाकात के बाद चंद्रशेखरन सीधे नई दिल्ली में एअर इंडिया के ऑफिस पहुंचे दूसरी ओर देश के सबसे बड़े बैंक स्टेट बैंक ने कहा कि वह बैंकों के समूह के साथ किसी भी तरह के लोन की जरूरत के लिए तैयार है"; 
		sb.options[7].value="बिहार में अभ्यर्थियों के व्यापक विरोध प्रदर्शन को देखते हुए रेलवे बोर्ड ने बड़ा फैसला किया है रेल मंत्रालय ने और लेवल वन परीक्षा पर फिलहाल रोक लगा दी है इसके अलावा रेल मिनिस्ट्री ने एक हाई पावर कमेटी का गठन कर दिया है यह कमेटी परीक्षा में पास और फेल हुए अभ्यर्थियों की शिकायत को सुनेगी और इसकी रिपोर्ट रेल मिनिस्ट्री को सौंपेगी इसके बाद रेल मंत्रालय आगे का निर्णय लेगा फिलहाल रेलवे की परीक्षा पर रेल मंत्रालय ने रोक लगा दी है बता दें कि देशभर में करीब करोड़ छात्रों ने परीक्षा के लिए आवेदन किया निर्मल कुमार आजाद के अनुसार रेल पुलिस के साथ ही वहां जिला पुलिस की टीम मौजूद है खुद गया के भी मौजूद हैं हालात को काबू करने में लगे हैं रेलवे में लॉ एंड ऑर्डर की समस्या बन गई है इस पर काबू पाने के लिए रेलवे के आला अधिकारियों से बात की जा रही है साथ ही सभी रेल जिला पुलिस को अलर्ट पर रखा गया है क्योंकि छात्र कभी भी कहीं भी रेलवे ट्रैक पर पहुंच जा रहे हैं और हंगामा करने लग रहे हैं जहानाबाद में लगातार 5 घंटे से छात्र रेलवे ट्रैक पर प्रदर्शन कर रहे है रेलवे ट्रैक पर ही प्रधानमंत्री और रेल मंत्री का पुतला फूंका गया उन्होंने सरकार विरोधी नारे भी लगाए छात्रों का कहना है कि जब तक हमारी मांग पूरी नहीं होगी तब तक आंदोलन जारी रहेगा जहानाबाद रेलवे स्टेशन के पास बुधवार की सुबह भारी संख्या में छात्रों ने गया पटना रेलखंड पर ट्रेन का परिचालन बाधित कर दिया सुबह से ही मेमू गाड़ी पैसेंजर को छात्रों ने रोककर सरकार विरोधी नारे लगाए छात्र रेलवे पटरी पर बैठकर प्रदर्शन कर रहे हैं और ट्रैक ठप पड़ा है रेल थाने की पुलिस छात्रों को समझाने बुझाने में लगा हुआ है लेकिन छात्र अपनी"; 
		sb.options[8].value="रिजल्ट में धांधली के विरोध में यूपी बिहार में छात्रों का प्रदर्शन बुधवार को भी जारी है गया जंक्शन पर पुलिस के निकलने के बाद उपद्रवी फिर से आए और ट्रेन की तीन बोगियों में आग लगा दी इसके पहले भी कुछ बोगियों को आग के हवाले किया गया था इसके बाद हालात को काबू करने के लिए पुलिस ने आंसू गैस के गोले भी छोड़े हैं जहानाबाद समस्तीपुर रोहतास समेत कई इलाकों में छात्र रेलवे ट्रैक पर उतर गए और नारेबाजी करने लगे प्रदर्शन कर रहे छात्रों की वजह से कई जगहों पर ट्रेन खड़ी हो गईं छात्रों के हिंसक प्रदर्शन को देखते हुए रेल मंत्री अश्विनी वैष्णव दोपहर साढ़े तीन बजे प्रेस कॉन्फ्रेंस की उन्होंने कहा कि हमारे पास परीक्षा को लेकर कोई शिकायत नहीं आई हमने जांच कमेटी बनाई है और वो इसकी जांच करेगी कमेटी 4 मार्च तक अपनी रिपोर्ट सौंप देगी उन्होंने छात्रों से अपील की कि रेलवे आपकी ही संपत्ति है और इसकी सुरक्षा करिए रेल मंत्री ने कहा कि कुछ लोग छात्रों के प्रदर्शन का गलत फायदा उठा रहे हैं छात्रों को भ्रमित न किया जाए ये मामला देश का है छात्रों से अपील है कि आप अपना विषय हमारे सामने रखिए और संवेदनशीलता के साथ इसे देखेंगे जहानाबाद में पुलिस ने आंसू गैस और बल प्रयोग कर ट्रैक को खाली कराया इससे पहले पुलिस और रेलवे के अधिकारी छात्रों को समझाने की कोशिश की लेकिन जब छात्र पथराव करने लगे तो पुलिसवाले लाठियां भांजने लगे पुलिस ने प्रदर्शन कर रहे छात्रों को खदेड़ दिया फिलहाल जहानाबाद स्टेशन पर दर्जनों पुलिसकर्मी तैनात हो चुके हैं ने सोशल मीडिया पर लिखा कि पार्टी घोटाले के खिलाफ आक्रोशित छात्रों पर आंसू गैस एवं लाठीचार्ज की क्रूरतापूर्ण कार्रवाई का पुरजोर विरोध करती है और छात्रों की मांगों का समर्थन करती है रिजल्ट को लेकर उत्तर प्रदेश"; 
		sb.options[9].value="लेकिन कई दशक बाद दस्तावेजों के आधार पर पता चला कि भारत की आजादी में आजाद हिंद फौज की महत्वपूर्ण भूमिका थी सवाल नेताजी को भारत सरकार से किस तरह का सम्मान मिलना चाहिए था जवाब इस विषय पर मेरा मानना है कि सरकार इस बारे में जो कुछ भी करना चाहती है कर सकती है लेकिन कुछ तथ्य सरकार ने छिपाए हैं मैं इस बात से बहुत निराश हूं सरकार ने सांप्रदायिक दंगों और झगड़ों पर कुछ नहीं कहा और ना ही कोई ठोस कदम उठाए ऐसे मामलों पर ना बोलना सरकार व देशहित में नहीं है यदि आप इसे दूसरी नजर से देखे तो मेरे लिए बड़ी खुशी की बात है कि लंबे समय बाद नेताजी के विचारों को पहचाना जा रहा है आजादी सात दशक बाद अब नेताजी के आदर्शों व मूल्यों को पहचान मिल रही है इससे देश में एक अच्छा संदेश जाएगा देश में गरीबी व निरक्षरता दूर को दूर करने की ज़रूरत है सवाल आपके अनुसार क्या राष्ट्रपिता महात्मा गांधी ने पंडित जवाहर लाल नेहरू का पक्ष लिया था जवाब 1930 में सुभाष चंद्र बोस को कांग्रेस अध्यक्ष बनाया गया लेकिन गांधीजी ऐसा नहीं चाहते थे इस बात को लेकर गांधीजी काफी नाराज भी हुए वो नेता जी को राजनीति से दूर करना चाहते थे मेरे अनुसार 1946 में कांग्रेस के नेतृत्व ने गांधीजी को लेट डाउन निराश किया जिससे गांधीजी काफी नाराज हुए थे मेरे पिताजी देश के विभाजन के खिलाफ थे यदि तब मेरे पिता जीवित होते तो गांधीजी से मतभेद के बाद भी वे देश का विभाजन स्वीकार नहीं करते सवाल नेता जी के निधन को लेकर अलग अलग चर्चा होती है आपके अनुसार सच क्या है जवाब मुझे प्लेन क्रैश की घटना के एक चश्मदीद के साक्षात्कार से पता चला कि 18 अगस्त 1945 को यह घटना हुई थी उसी";
        sb.options[10].value="जर्मनी में रहने वाली नेताजी सुभाष चंद्र बोस की बेटी अनीता बोस ने दैनिक भास्कर से बातचीत में कहा है कि राष्ट्रपिता महात्मा गांधी उनके पिता को राजनीति से दूर करना चाहते थे उन्होंने कहा मेरे पिता यदि जीवित होते तो देश के विभाजन को किसी भी सूरत में स्वीकार नहीं करते उन्होंने इंडिया गेट पर नेताजी की प्रतिमा लगाने को स्वागत योग्य कदम बताया है पेश है अनीता बोस से बातचीत के प्रमुख अंश सवाल इंडिया गेट पर नेता जी सुभाष चंद्र की प्रतिमा लगाने पर आपकी पहली प्रतिक्रिया क्या है जवाब मैं बहुत खुश हूं कि नेता जी की प्रतिमा को भारत सरकार ने इंडिया गेट पर लगाया है यह स्वागत योग्य कदम है एक स्वतंत्रता सेनानी की प्रतिमा लंबे समय बाद वहां लगाई गई है अभी तो ये प्रतिमा होलोग्राम की है आगे वास्तविक प्रतिमा कैसी होगी ये बाद में पता लगेगा सवाल जिस जगह पर नेता जी की प्रतिमा लगाई गई है वहां पहले अमर जवान ज्योति लगी थी जिसे अब हटा दिया है कुछ राजनीतिक दल इसका विरोध कर रहे है आप क्या मानती है जवाब मैं प्रतिमा लगाने का स्वागत करती हूं जो कभी कोई और पार्टी नहीं चाहती थी जो लोग विरोध कर रहे हैं मैं उनसे कहना चाहती हूं अगर वो चाहते हैं कि प्रतिमा लगने वाली जगह हमेशा खाली रहे तो उसका कोई विकल्प नहीं है मेरा मानना है जो भी महान व्यक्ति इस स्थान के लिए उपयुक्त लगे उसकी प्रतिमा लगा दी जाए नेताजी के अलावा गांधीजी की प्रतिमा भी लगाई जा सकती है सवाल नेताजी सुभाष चंद्र बोस को जो सम्मान मिलना चाहिए था वो सम्मान भारत में मिला या उनके साथ अन्याय जवाब मेरा मानना है कि उस समय की सरकार को ऐसा लगा कि भारत को जो आजादी मिली है वो अहिंसा की वजह से मिली है"; 
		sb.options[11].value="भारत और साउथ अफ्रीका के बीच खेले जा रहे वनडे सीरीज के आखिरी मैच में अफ्रीकी पारी के दौरान विराट कोहली की बेटी वामिका स्क्रीन पर नजर आईं भारतीय पारी के दौरान जब विराट ने अर्धशतक पूरा किया तब स्टैंड्स में अनुष्का शर्मा की गोद में उनकी बेटी भी थीं इतना ही नहीं फिफ्टी लगाने के बाद कोहली ने भी वामिका को देखकर मजेदार रिएक्शन दिया विराट का रिएक्शन देखने के बाद अनुष्का और वामिका तालियां बजाती हुई नजर आईं अनुष्का ने ब्लैक और उनकी बेटी वामिका ने पिंक कलर की ड्रेस पहनी थी वामिका का ये चंद सेकेंड का वीडियो सामने आते ही छा गया और तमाम फैंस का विराट अनुष्का की बेटी की पहली झलक देखने का इंतजार भी खत्म हो गया दरअसल विराट कोहली ने फैसला लिया है कि जब तक उनकी बेटी समझदार नहीं हो जाती वह उन्हें सोशल मीडिया और कैमरे से दूर रखेंगे इसलिए आज तक उन्होंने अपने सोशल मीडिया अकाउंट पर कभी भी वामिका की कोई तस्वीर शेयर नहीं की है इतना ही नहीं उन्होंने इस बारे में रिक्वेस्ट भी की थी कि कोई वामिका की फोटो ना ले हालांकि फिलहाल वामिका की पहली झलक पाकर फैंस काफी खुश नजर आ रहे हैं बेटी के जन्मदिन पर भी नहीं शेयर की थी फोटो बेटी के जन्म की जानकारी विराट ने खुद सोशल मीडिया पर एक पोस्ट शेयर कर फैंस को दी थी इस पोस्ट में उन्होंने केवल कैप्शन लिखा था बेटी का चेहरा नहीं दिखाया था उन्होंने लिखा था हम दोनों को यह बताते हुए बहुत खुशी हो रही है कि आज दोपहर को हमारे यहां बेटी हुई है हम आपके प्यार और शुभकामनाओं के लिए दिल से आभारी हैं अनुष्का और हमारी बेटी दोनों बिल्कुल ठीक हैं और हमारा यह सौभाग्य है कि हमें इस जिंदगी का यह चैप्टर अनुभव करने को मिला हम जानते हैं"; 
		sb.options[12].value="वीडियो पोस्ट की है सुशांत को लोग प्यार से कहते थे उनके फॉलोअर्स के रील्स सोशल मीडिया पर धूम मचा रहे हैं यह बताती है कि इस बिहारी हीरो की धमक कैसी थी मीनू होडा की रील्स में बताया गया है कि वह कैसे जीने की वजह बनते गए चारों ओर से उन्हें जन्म दिन की शुभकामनाएं दी जा रही हैं उनको चाहने वाले उनके बर्थ डे मनाने वाली पुरानी फोटो भी शेयर कर रहे हैं लोग सोशल मीडिया पर 'जस्टिस ऑर सुशांत' भी लिख रहे हैं सुशांत की बहन श्वेता सिंह कीर्ति ने जो वीडियो सोशल मीडिया पर पोस्ट किया है उसमें से जुडा खूबसूरत विजुअल है और सुशांत के बर्ड प्रेम डॉग प्रेम से लकेर गिटार प्रेम क्रिकेट प्रेम ब्लाइंड बच्चे को गले लगाने वाले मार्मिक पल हैं वे टेनिस खेलते दिखते हैं तो कभी एक बच्चे को किस करते दूरबीन से चांद को देखने से लेकर संगीत से उनके प्रेम और मां की गोद में सुशांत कैसे दिखते थे वह सब इसमें है इसे देखकर ऐसा लगता है सुशांत यहीं कहीं हमारे आसपास हैं एक फोटो में वे शिव की गोद में दिख रहे हैं सुशांत की मौत के बाद महाराष्ट्र सरकार और बिहार सरकार में जैसे ठन सी गई थी सुशांत के पिता ने पटना में मुकदमा दर्ज किया था और बिहार से पुलिस मुम्बई गई थी तब डीजीपी गुप्तेश्वर पांडेय थे पांडेय ने इस मौत पर कड़ा रुख अख्तियार किया था तब महाराष्ट्र सरकार का इस मामले को लेकर असहयोग वाला रवैया सामने आया था बाद में मामला सीबीआई को सौंप दिया गया सुशांत की मौत की मिस्ट्री काफी दिनों तक मीडिया में छपती रही आज पटना के सुशांत सिंह राजपूत की बर्थ एनिवर्सरी है पूरे देश के लोगों को सुशांत याद आ रहे हैं लेकिन बिहार के लोगों का दर्द सबसे बड़ा है वे"; 
		sb.options[13].value="सलमान खान ने अपने पनवेल फार्म हाउस के पड़ोसी केतन कक्कड़ के खिलाफ मानहानि का मुकदमा दायर किया है अब यह मामला हर दिन तूल पकड़ता जा रहा है एक्टर ने कोर्ट के माध्यम से केतन को मानहानि के मुकदमे में धर्म को बीच में नहीं लाने को कहा है गौरतलब है कि केतन ने एक इंटरव्यू में सलमान खान पर कई आरोप लगाए हैं सलमान के पड़ोसी केतन कक्कड़ के वीडियो खूब शेयर किए जा रहे थे सलमान खान ने कोर्ट से केतन को बदनाम करने से रोकने और सभी वीडियो को सोशल मीडिया से हटाने के लिए भी कहा है कक्कड़ ने सलमान पर डी गैंग के लिए काम करने और उनकी धार्मिक पहचान के ऊपर टिपप्णी की है साथ ही कक्कड़ ने सलमान पर राज्य की सत्ताधारी पार्टी से जुड़े होने बाल तस्करी का आरोप लगाया है गुरुवार जनवरी को इस मामले में दो घंटे की सुनवाई हुई इस दौरान सलमान ने अपने वकील के माध्यम से कहा कि बिना किसी पेपर प्रूफ के यह सारे आरोप उनकी दिमाग की उपज हैं प्रॉपर्टी के विवाद पर आप मेरी पर्सनल रेपुटेशन को क्यों खराब कर रहे हैं? आप इस विवाद में मेरे धर्म को भी क्यों ला रहे हैं? मेरी मां हिंदू हैं पिता मुसलमान और मेरे भाईयों की भी शादी हिंदू लड़कियों से हुई है हम सब लोग मिलकर सारे त्योहार साथ सेलिब्रेट करते हैं सलमान ने आगे कहा आप एक पढ़े लिखे इंसान हैं कोई गुंडा छाप नहीं जो इस तरह के आरोप लगाएं आजकल सबसे आसान काम है कुछ लोगों को इकट्ठा करना सोशल मीडिया पर आना और अपना सारा गुस्सा निकाल देना सुशांत सिंह राजपूत अब हमारे बीच नहीं हैं लेकिन उनके जन्मदिन को उनके फॉलोअर्स अपने अपने अंदाज में मना रहे हैं उनकी बहन श्वेता सिंह कीर्ति इंस्टाग्राम पर सुशांत की फोटो और"; 
		sb.options[14].value="में फ्लॉप रहे थे मौजूदा सीरीज में उनके लिए काफी कुछ दांव पर लगा हुआ है राहुल के अलावा अन्य भारतीय बल्लेबाजों ने भी पहले मुकाबले में बहुत निराशाजनक प्रदर्शन किया था सौरव गांगुली कोलकाता से हैं वहीं सचिव जय शाह अहमदाबाद से हैं दो स्टेडियम के तौर पर ईडेन गार्डेंस और मोटेरा को चुने जाने के पीछे इनके प्रभाव को कारण बताया जा सकता है देश में इंटरनेशनल मैच कराने लायक दो दर्जन से ज्यादा स्टेडियम हैं इसके बावजूद फरवरी 2020 से अब तक कोरोनाकाल में भारत में हुए एपल वर्चुअल रियलिटी और ऑग्मेंटेड रियलिटी से काम कर रहा है और कई पेटेंट फाइल कर चुका है माना जा रहा है कि में होने वाले इवेंट में एपल अपने का प्रदर्शन कर सकता है हालांकि एपल काफी सोच-समझ कर अपने प्रोडक्ट लांच करता है इसलिए अभी शायद एपल ग्लासेस लांच न किए जाएं लेकिन हेडसेट जरूर लांच हो सकते हैं ये ग्लासेस काफी लाइट-वेट होंगे और साथ ही ये कई अलग-अलग जैश्चर कंट्रोल के साथ आएंगे जिससे आप कॉल पिक करने से लेकर फोटो क्लिक करना या म्यूजिक प्ले करने जैसी सभी टास्क आसानी से कर पाएंगे ये पहले वर्जन के मुकाबले ज्यादा हल्के होने और ज्यादा कॉम्फर्टेबल भी होंगे आईफोन सीरीज आईफोन को लेकर हर साल फैन्स काफी उत्साहित रहते हैं और इस साल भी आईफोन 14 सीरीज के लिए काफी उत्साहित हैं आईफोन 14 के कैमरा में काफी सुधार देखने को मिलेगा जैसे कि कैमरा बंप को और कम करने की कोशिश रहेगी उसकी वजह से की बॉडी थोड़ी बल्की हो सकती है इसमें मिलेगा पेरिस्कोपिक जूम लेंस और फ्रंट में पिल शेप कैमरा मॉड्यूल देखने को मिल सकता है गेमर्स के लिहाज से इसमें नए तरह का वैपर चैम्बर दिया जाएगा जो फोन को जल्दी ठंडा करेगा साथ ही इसमें दी जाएगी जो होगी ऐसा भी माना जा रहा है"; 
		sb.options[15].value="सरकार ने गुरुवार को बच्चों के लिए नई कोरोना गाइडलाइन जारी की है इसमें 5 साल तक से वनडे सीरीज के लिए टीम इंडिया को जीत का फेवरेट माना जा रहा था लेकिन पहले मुकाबले के दौरान पूरी टीम बिखरी नजर आई गेंदबाजी में उपकप्तान जसप्रीत बुमराह को छोड़कर कोई भी बॉलर बढ़िया लय में नहीं दिखाई पड़ा पहले मैच में एक समय अफ्रीकी टीम ने गंवा दिए थे लेकिन उसके बाद भारतीय गेंदबाज दबाव बनाने में नाकाम रहे और मेजबान टीम ने लगभग स्कोर बोर्ड पर लगा दिया राज्यों में एक्टिव केस सबसे ज्यादा सरकार ने कहा है कि तीसरी लहर में मौतें दूसरी लहर के मुकाबले काफी कम हुई हैं स्वास्थ्य सचिव राजेश भूषण ने गुरुवार को प्रेस कॉन्फ्रेंस के दौरान कहा कि यूपी महाराष्ट्र कर्नाटक तमिलनाडु केरल बंगाल गुजरात ओडिशा दिल्ली और राजस्थान में एक्टिव केस सबसे डॉ. बलराम भार्गव ने कहा कि वैक्सीनेशन भारत के लिए फायदेमंद साबित हुआ है वैक्सीनेश के चलते ही तीसरी लहर में मौतों की संख्या काफी घटी है वैक्सीनेशन ज्यादा होने की वजह से ही हम गंभीर संक्रमण और बहुत ज्यादा मौतें नहीं देख रहे हैं दिए जा चुके हैं गुरुवार को स्वास्थ्य मंत्री मनसुख मांडविया ने ट्विटर पर इस बात की जानकारी दी इसके साथ ही देश में फुली वैक्सीनेटेड लोगों की संख्या हो गई है यह कुल आबादी का खिलाफ पहले मैच में मिली हार के बाद 3 मैचों की वनडे सीरीज में टीम इंडिया को अपनी संभावनाएं जीवित रखने के लिए जीत से बढ़कर कुछ नहीं होगा भारत और साउथ अफ्रीका के बीच दूसरा वनडे शुक्रवार को पार्ल के मैदान पर खेला जाएगा इस मैच में भारतीय बल्लेबाजों के अलावा कप्तान केएल राहुल के दांवपेंच पर भी फैंस की नजरें बनी रहेंगी टेस्ट टीम की कप्तानी के दावेदारों में से एक राहुल पहले वनडे में कप्तान के रूप"; 
		sb.options[16].value="अनुरोध किया है सांसद ने बताया कि जिस जगह से त्सांगपो नदी भारत में एंट्री करती है ये घटना वहीं हुई है त्सांगपो को अरुणाचल प्रदेश में सियांग और असम में ब्रह्मपुत्र कहा जाता है सांसद ने बताया कि यह लुंगता जोर एरिया में आता है चीन ने में इस एरिया में किलोमीटर तक सड़क बना ली थी यह इलाका सियुंग्‍ला के अंडर आता है दोनों ही लड़के जिदो गांव के रहने वाले हैं सांसद गाओ ने इस मामले से जुड़ी जो जानकारी ट्विटर पर शेयर की है उसमें उन्होंने प्रधानमंत्री मोदी गृहमंत्री अमित शाह रक्षामंत्री राजनाथ सिंह और इंडियन आर्मी को भी टैग किया है सितंबर में भी ने अरुणाचल प्रदेश के सुबनसिरी जिले से पांच युवकों का अपहरण कर लिया था और लगभग एक हफ्ते बाद उन्हें रिहा कर दिया था भारत लद्दाख से अरुणाचल प्रदेश तक चीन के साथ किलोमीटर लंबी लाइन ऑफ एक्चुअल कंट्रोल शेयर करता है अरुणाचल प्रदेश की किमी लंबी सीमा चीन से लगी है इसके अलावा किमी लंबी सीमा म्यांमार और किमी लंबी सीमा भूटान से भी लगी है दिवंगत जनरल बिपिन रावत के भाई रिटायर्ड कर्नल विजय रावत बुधवार को भाजपा में शामिल हो गए बताया जा रहा है कि वे उत्तराखंड से चुनाव लड़ सकते हैं विजय रावत ने सुबह उत्तराखंड के मुख्यमंत्री पुष्कर सिंह धामी से मुलाकात की थी इसके बाद कहा था कि विचारधारा भाजपा से मिलती है और पार्टी ने कहा तो चुनाव भी लड़ूगा अंडर वर्ल्ड कप में टीम इंडिया को बड़ा झटका लगा है कप्तान यश धुल और उप कप्तान शेख रशीद सहित टीम के छह खिलाड़ी कोरोना के चपेट में गए हैं सभी खिलाड़ियों को आइसोलेट किया गया है कोरोना संक्रमित होने के कारण कप्तान और उप कप्तान आयरलैंड के खिलाफ दूसरे मैच में नहीं खेल रहे हैं टीम का निशांत सिंधू कर रहे हैं"; 
		sb.options[17].value="अफगानिस्तान के एंबेसडर फारिद मामुंडजे आए थे उनको सुखना लेक में बोटिंग करनी थी इसलिए कोरोना प्रोटोकॉल को तोड़ते हुए एक ग्रुप के साथ न सिर्फ बोटिंग करवाई गई बल्कि विजिट के दौरान कई ग्रुप मेंबर्स के मास्क भी उतरे हुए थे साफ तौर पर उन कोविड नियमों का उल्लंघन किया गया जिनके लिए आम आदमी को फाइन भरना पड़ता है बोटिंग करने का एक वीडियो सोशल मीडिया पर वायरल हुआ है जिसके बाद कोरोना प्रोटोकॉल को लेकर प्रशासन की गंभीरता को लेकर सवाल उठाया जा रहा है संबंधित वीडियो में साफ तौर पर अफसर बोटिंग करने के बाद बोट से बाहर आते नजर आ रहे हैं दूसरी ओर प्रशासनिक अधिकारी इस बारे में कुछ बोलने को तैयार नहीं हैं 11 जनवरी की यह वीडियो बताया जा रहा है जब ट्राईसिटी के अफगान स्टूडे्टस के लिए विशेष वैक्सीनेशन कैंप सुखना लेक वैक्सीनेशन सेंटर में आयोजित किया गया था इस दौरान अफगानिस्तान के एंबेसडर फारिद मामुंडजे ने स्टूडेंट्स के साथ उनसे जुड़े मुद्दों को लेकर बातचीत की थी तब एंबेसडर को उनकी टीम सहित बोटिंग करवाई गई थी चीन की पीपुल्स लिबरेशन आर्मी ने अरुणाचल प्रदेश के सियांग जिले से 17 साल के एक लड़के का किडनैप कर लिया राज्य के सांसद तपीर गाओ ने बुधवार को इसकी जानकारी दी किडनैप किए लड़के का नाम मिराम टैरोन है ने को मिराम को किडनैप किया था मिराम का दोस्त भागने में कामयाब रहा सांसद गाओ ने न्यूज एजेंसी को फोन पर बताया कि मिराम का एक दोस्त जॉनी यायिंग चीनी सैनिकों के पास से भागने में कामयाब रहा है यायिंग ने भागने के बाद स्‍थानीय अधिकारियों को इसकी जानकारी दी सांसद गाओ ने इस मामले की जानकारी गृहराज्य मंत्री एन प्रमाणिक को दी है इसके साथ ही उन्होंने भारत सरकार की सभी एजेंसीज से मिराम की रिहाई के लिए जरूरी कदम उठाने"; 
		sb.options[18].value="इसे जल्द ही बेस पोर्ट की ओर लौटना था तभी ये विस्फोट हुआ पूर्वी नौसेना कमान में आईएनएस रणवीर नवंबर से ही तटीय इलाके में ऑपरेशनल तैनाती पर था और उसे कुछ देर बाद ही बेस पोर्ट की ओर लौटना था तभी ये विस्फोट हुआ जानकारी के मुताबिक इस धमाके में जहाज को बहुत ज्यादा नुकसान नहीं हुआ है इस घटना के तुरंत बाद ही बचाव कार्य शुरू किया गया थोड़ी देर बाद ही शिप पर तैनात चालक दल के सदस्यों ने आग को काबू में कर लिया जिससे जहाज को बहुत ज्यादा नुकसान नहीं हुआ है बोर्ड ऑफ इनक्वायरी का आदेश इंडियन नेवी ऑफिशियल्स के मुताबिक रणवीर ईस्टर्न नेवल कमांड से क्रॉस कोस्ट ऑपरेशनल डेप्लॉयमेंट पर निकला हुआ था और जल्द ही बेस पोर्ट पर लौटने वाला था ब्लास्ट के कारणों की जानकारी नहीं मिल सकी है इसकी जांच के लिए एक बोर्ड ऑफ इंक्वायरी तैनात किए जाने के आदेश दिए गए हैं महाराष्ट्र के एक पुलिस अधिकारी का गाना करीना कपूर को इतना पसंद आया कि वो इसे शेयर करने से खुद को रोक न सकीं इस वायरल वीडियो में महाराष्ट्र पुलिस के ने करीना के दादा राज कपूर के फेमस गाने 'ए भाई जरा देख कर चलो' की पैरोडी की है गाने के माध्यम से पुलिस लोगों को मास्क पहनने के लिए जागरूक कर रही है करीना कपूर खान को अपने दादा के गाने पर बनी यह पैरोडी बेहद पसंद आई उन्होंने इस वीडियो को इंस्टाग्राम पर शेयर कर लिखा- ब्रीलियंट सॉन्ग इस गाने को अपनी आवाज देने वाले पुणे पुलिस के प्रमोद कलमकार ने कहा कि तीसरी लहर में ओमिक्रॉन का खतरा लगातार बढ़ रहा है सेकंड फेज में भी हमने कोरोना अवेयरनेस के लिए एक गाना तैयार किया था इस गाने को हमने पहले बना लिया था लेकिन तीसरी लहर के बढ़ते प्रसार को देखते हुए हमने इसे रिलीज किया है"; 
		sb.options[19].value="कि आप यह जरूर समझेंगे कि इस समय सबको थोड़ी प्राइवेसी चाहिए होगी साउथ अफ्रीका के खिलाफ टेस्ट सीरीज में मिली हार के बाद विराट कोहली ने सभी को हैरानी में डालते हुए टेस्ट की कप्तानी छोड़ दी थी टेस्ट की कमान छोड़ने से पहले वर्ल्ड कप के बाद उन्हें फटाफट क्रिकेट फॉर्मेट की कप्तानी के पद से भी इस्तीफा दे दिया था वहीं अफ्रीका दौरे पर रवाना होने से पहले कोहली को वनडे की कप्तानी से हटा दिया गया था कोहली के टेस्ट की कप्तानी छोड़ने के बाद अनुष्का शर्मा ने सोशल मीडिया पर लिखा था मुझे 2014 का वह दिन याद है जब आपने मुझसे आकर कहा था कि आपको कप्तान बनाया गया है क्योंकि एमएस ने टेस्ट क्रिकेट से संन्यास लेने का फैसला किया था मुझे याद है एमएस आप और मैं उस दिन हम बात कर रहे थे और वह मजाक कर रहे थे कि आपकी दाढ़ी जल्द ही सफेद होने लगेगी हम सभी को इस पर हंसी आई थी उस दिन के बाद से मैंने आपकी दाढ़ी को सफेद होने के अलावा और भी बहुत कुछ देखा है मैंने ग्रोथ देखी है आपके आसपास और आप में भी साउथ अफ्रीका सीरीज में शर्मनाक हार के बाद विराट कोहली ने टेस्ट से कप्तानी छोड़ दी है विराट कोहली ने एक स्टेटमेंट के जरिए इस बात की जानकारी दी उन्होंने शनिवार शाम एक स्टेटमेंट जारी कर इस बात की सूचना दी विराट ने कहा कि मैं हमेशा हर चीज में योगदान देना चाहता हूं अगर मैं ऐसा नहीं कर पाता हूं तो यह गलत होगा मैं इस बात को लेकर एकदम स्पष्ट हूं और मैं अपनी टीम के साथ बेइमानी नहीं कर सकता हूं कोहली ने टी वर्ल्ड कप के शुरू होने से पहले ही इस फॉर्मेट की कप्तानी छोड़ दी थी वहीं साउथ अफ्रीका दौरे से पहले उनको वनडे की कप्तानी से पद से भी हटा दिया गया था"; 
    var para1=document.getElementById("data").value;
    document.getElementById("message").innerHTML=para1;
    document.getElementById("data").style.display = "none";
}

///////////////////////////////////////////////////////////////////////

var len=0;
var flag=true;
var tm=900;

function timerWatch()
{
		var mm=parseInt(tm/60);
		var hh=parseInt(mm/60);
		mm=mm%60;
		if(hh<=9)
			hh="0"+hh;
		if(mm<=9)
			mm="0"+mm;
		var ss=tm%60;
		if(ss<=9)
			ss="0"+ss;
		tm=tm-1;
		if(tm<=0){
			document.getElementById("start-btn").click();
		}
		else{
		document.getElementById("timer").innerHTML="Time Left "+hh+":"+mm+":"+ss;
		}	
	
	setTimeout("timerWatch()",1000);
	
}
function resetCounter(){ 
  clearInterval(interval); 
  i = 0; 
  counter.innerHTML = i; 
} 

//////////////////////////////////////////////////////////////////////

var elem = document.documentElement;
function openFullscreen() {
  if (elem.requestFullscreen) {
    elem.requestFullscreen();
  } else if (elem.webkitRequestFullscreen) { /* Safari */
    elem.webkitRequestFullscreen();
  } else if (elem.msRequestFullscreen) { /* IE11 */
    elem.msRequestFullscreen();
  }
}

//////////////////////////////////////////////////////////////////////////

document.getElementById('text').onmousedown = function(e){
    e.preventDefault();
  }
  function isValidKey1(e) {
          var evt = e || window.event;
          if (evt) 
          {
              var keyCode = evt.charCode || evt.keyCode;
              
              if (keyCode === 8) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
              if (keyCode === 13) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
              if (keyCode === 37) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
              if (keyCode === 38) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
              if (keyCode === 39) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
              if (keyCode === 40) 
              {
                  if (evt.preventDefault) {
                      evt.preventDefault();
                  } else {
                      evt.returnValue = false;
                  }
              }
          }
      }

////////////////////////////////////////////////////////////////////////////////////

function heightlite()
{  var para=document.getElementById("data").value;
   var pass=para.split(" ");
   var len=pass.length;
   var msg="";
   
   var typ=document.getElementById("text").value;

   var typPara1=typ.split(" ");
//	typPara = typPara.filter(elm => elm);
   var typPara=Array();
   for (var i = 0; i < typPara1.length; i++) 
   {
       if(typPara1[i]) 
       {
         typPara.push(typPara1[i]);
       }
     }
   
   var typLen=(typPara.length-1);
   
   if(typLen>=0){
       msg="<font color='#0000EE'>";
   }
   
   for(w=0; w<len; w++)
   {
      msg=msg+" "+pass[w];
      if(typLen==w)
      {
          msg=msg+"</font>";
      }
   }
   document.getElementById("message").innerHTML=msg;
   
}

/////////////////////////////////////////////////////////////////////////////

$(document).ready(function() {
    let button= document.getElementById("start-btn");
    let text= document.getElementById("text");
    let message= document.getElementById("message");
    let result= document.getElementById("result");
    let startTime, endTime;
    
    text.disabled=true;
    const start = () => {
    
    let date= new Date();
    startTime = date.getTime();
    }
    
    const end= () => {
        let date= new Date();
        let endTime= date.getTime();
        let timeTaken= (endTime-startTime-800)/1000;
        console.log(timeTaken);
        let mm=parseInt(timeTaken/60);
        let hh=parseInt(mm/60);
            mm=mm%60;
            if(hh<=9)
                hh="0"+hh;
            if(mm<=9)
                mm="0"+mm;
        let ss=parseInt(timeTaken%60);
            if(ss<=9)
                ss="0"+ss;
    
        let tkeyStroks=message.innerText.length;
        let totalWords= (message.innerText.split(" ")).length;
        if((text.value.trim()).length>0)
        {
            var wordsCount= (text.value.split(" ")).length;
        }
        else {
            var wordsCount=0;
        }
    
        console.log(totalWords+ " "+wordsCount+message.innerText);
        
        let gspeed= Math.round(((60/timeTaken)*wordsCount));
    
        let correctWords=accuracy(text.value,message.innerText);
        console.log('Total Words:'+wordsCount+ 'Correct Words:'+correctWords);
    
        let wrongWords=wordsCount-correctWords;
        let nspeed= Math.round(((60/timeTaken)*correctWords));
        let ukeyStroks=text.value.length;
        let message1=text.value;
        let e = document.getElementById("data");
        let paraNo = e.options[e.selectedIndex].text;
    
        $("#main1").html(`
        
        <h3>Test Submitted Successfully. Here Are Your Details:</h3><br>
        <div align="justify" id="dispPara" style=" width:95%; line-height:25px; font-size:16px; padding: 8px; border:1px solid gray; margin: 8px; cursor: no-drop;">
            ${message1}</div>
            <br>
        <table border="1" style="border:3px solid black; width:60%; font-size:25px; background-color:#e8e4e4;">
        <tr>
            <td>Test Name</td><td>${paraNo}</td>
        </tr>
        <tr>
            <td>Test Language</td><td>Hindi</td>
        </tr>
        <tr>
            <td>Gross Speed</td><td>${gspeed} WPM</td>
        </tr>
        <tr>
            <td>Net Speed</td><td>${nspeed} WPM</td>
        </tr>
        <tr>
            <td>Accuracy</td><td>${Math.round((correctWords/wordsCount)*100)}%</td>
        </tr>
        <tr>
            <td>Time Taken By You</td><td>${mm}:${ss}</td>
        </tr>
        <tr>
            <td>Totle World</td><td>${totalWords}</td>
        </tr>
        <tr>
            <td>Words Typed</td><td>${wordsCount}</td>
        </tr>
        <tr>
            <td>Correct Words</td><td>${correctWords}</td>
        </tr>
        <tr>
            <td>Wrong Words</td><td>${wrongWords}</td>
        </tr>
        <tr>
            <td>Totle KeyStoks</td><td>${tkeyStroks}</td>
        </tr>
        <tr>
            <td>Typed KeyStoks</td><td>${ukeyStroks}</td>
        </tr>
    </table>
        <br>
        <a href="../index.html">Refresh The Page To Start Test Again Or Click Here To Goback to Homepage</a>
        `);
        $("#text").prop("disabled",true);
    }
    
    const accuracy = (str,message) => {
    
    message=(message.split(" "));
    let count=0;
    console.log(message);
     str.trim().split(" ").forEach(function (item) { 
                console.log("item: "+item+ message.indexOf(item)); 
                if(message.indexOf(item) > -1)
                    count++;
             
            }); 
     return count;
    }
    
    
    button.addEventListener('click',function(){
            console.log("Clicked ");
        if(this.innerText === "Start")
        {	
            $("textarea").val("");
            console.log('Started');
            this.innerText="Submit";
            $("#result").fadeOut();
            $("#text").prop("disabled",false);
            start();
            timerWatch();
            openFullscreen();
            getData();
    
        }
        else
        {	
            $("#result").fadeIn();
            console.log('Submit');
            $(this).html("Start");
            end();
            
    
        }
    });
    
    
        
    });
    
//////////////////////////////////////////////////////////////////////    